
<footer class="footer mt-auto py-3 bg-light">
          <div class="container col-xxl-8 px-4 py-5">

            <div class="row row-cols-1 row-cols-sm-2 row-cols-md-3 g-3">

              <div class="col">
                <div class="img-footer">
                  <img src="{{ URL('img\Logo.png') }}" alt="" width="120" height="100">
                </div>
                <div class="card-body">
                  <p class="p-footer" style="color: #ff66c4;">ซุมหมู่เฮา</p>
                  <p class="p-footer-text">ความสัมพันธ์ใกล้ชิดและมั่นคง เปิดใจและไว้วางใจได้ พูดคุยและแชร์เรื่องราวต่างๆ กันได้อย่างสบายใจ</p>
                </div>
              </div>
              
              <div class="col">
                <div class="card-body">
                  <p class="p-footer" style="color: #ff66c4;">ติดต่อหาเฮา</p>

                  <!-- facebook -->
                   <a href="https://www.facebook.com/FotoBeginCactus/">
                    <div class="d-grid gap-2 d-md-flex justify-content-md-start"><br>
                      <svg height="21" viewBox="0 0 32 32" width="21" xmlns="http://www.w3.org/2000/svg"><path d="m32 16c0-8.839-7.167-16-16-16-8.839 0-16 7.161-16 16 0 7.984 5.849 14.604 13.5 15.803v-11.177h-4.063v-4.625h4.063v-3.527c0-4.009 2.385-6.223 6.041-6.223 1.751 0 3.584.312 3.584.312v3.937h-2.021c-1.984 0-2.604 1.235-2.604 2.5v3h4.437l-.713 4.625h-3.724v11.177c7.645-1.199 13.5-7.819 13.5-15.803z"/></svg>
                      <p class="p-footer-text">Facebook</p>
                    </div>
                   </a>

                   <!-- line -->
                   <a href="https://line.me/th/">
                    <div class="d-grid gap-2 d-md-flex justify-content-md-start"><br>
                    <svg height="21" viewBox="0 0 32 32" width="21" xmlns="http://www.w3.org/2000/svg"><path d="m25.817 13.151c.469 0 .844.38.844.839 0 .464-.375.844-.844.844h-2.339v1.5h2.339c.469 0 .844.375.844.839 0 .459-.375.839-.844.839h-3.177c-.463 0-.837-.38-.837-.839v-6.36c0-.463.375-.843.837-.843h3.183c.464 0 .839.38.839.843 0 .464-.375.839-.844.839h-2.339v1.5zm-5.134 4.021c0 .359-.235.683-.579.797-.083.025-.177.041-.265.041-.281 0-.521-.125-.683-.333l-3.255-4.427v3.921c0 .459-.371.839-.839.839-.464 0-.839-.38-.839-.839v-6.36c0-.359.235-.681.573-.796.083-.032.181-.043.26-.043.26 0 .5.141.661.339l3.281 4.437v-3.937c0-.463.375-.843.839-.843s.844.38.844.843zm-7.656 0c0 .459-.376.839-.844.839-.459 0-.833-.38-.833-.839v-6.36c0-.463.375-.843.839-.843.463 0 .839.38.839.843zm-3.287.839h-3.183c-.464 0-.844-.38-.844-.839v-6.36c0-.463.38-.843.844-.843s.839.38.839.843v5.521h2.344c.463 0 .839.375.839.839 0 .459-.381.839-.839.839zm22.26-4.262c0-7.161-7.183-12.989-16-12.989s-16 5.828-16 12.989c0 6.417 5.693 11.792 13.38 12.813.521.109 1.229.344 1.412.787.161.4.104 1.02.052 1.443l-.219 1.359c-.063.401-.323 1.579 1.396.86 1.724-.719 9.224-5.437 12.583-9.303 2.297-2.515 3.396-5.099 3.396-7.959z"/></svg>
                      <p class="p-footer-text">Line</p>
                    </div>
                   </a>

                   <!-- github -->
                   <a href="https://github.com/phutsadeejandee/bestfriend">
                    <div class="d-grid gap-2 d-md-flex justify-content-md-start"><br>
                    <svg height="21" viewBox="0 0 24 24" width="21" xmlns="http://www.w3.org/2000/svg"><path d="m0 0h24v24h-24z" fill="#fff" opacity="0" transform="matrix(-1 0 0 -1 24 24)"/><path d="m12 1a10.89 10.89 0 0 0 -11 10.77 10.79 10.79 0 0 0 7.52 10.23c.55.1.75-.23.75-.52s0-.93 0-1.83c-3.06.65-3.71-1.44-3.71-1.44a2.86 2.86 0 0 0 -1.22-1.58c-1-.66.08-.65.08-.65a2.31 2.31 0 0 1 1.68 1.11 2.37 2.37 0 0 0 3.2.89 2.33 2.33 0 0 1 .7-1.44c-2.44-.27-5-1.19-5-5.32a4.15 4.15 0 0 1 1.11-2.91 3.78 3.78 0 0 1 .11-2.84s.93-.29 3 1.1a10.68 10.68 0 0 1 5.5 0c2.1-1.39 3-1.1 3-1.1a3.78 3.78 0 0 1 .11 2.84 4.15 4.15 0 0 1 1.17 2.89c0 4.14-2.58 5.05-5 5.32a2.5 2.5 0 0 1 .75 2v2.95s.2.63.75.52a10.8 10.8 0 0 0 7.5-10.22 10.89 10.89 0 0 0 -11-10.77" fill="#231f20"/></svg>
                      <p class="p-footer-text">Github</p>
                    </div>
                   </a>

                   <!-- ig -->
                   <a href="https://www.instagram.com/is_somtuay/">
                    <div class="d-grid gap-2 d-md-flex justify-content-md-start"><br>
                    <svg height="21" data-name="Instagram w/circle" width="21" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 19.2 19.2"><path d="M13.498 6.651a1.656 1.656 0 0 0-.95-.949 2.766 2.766 0 0 0-.928-.172c-.527-.024-.685-.03-2.02-.03s-1.493.006-2.02.03a2.766 2.766 0 0 0-.929.172 1.656 1.656 0 0 0-.949.95 2.766 2.766 0 0 0-.172.928c-.024.527-.03.685-.03 2.02s.006 1.493.03 2.02a2.766 2.766 0 0 0 .172.929 1.656 1.656 0 0 0 .95.949 2.766 2.766 0 0 0 .928.172c.527.024.685.029 2.02.029s1.493-.005 2.02-.03a2.766 2.766 0 0 0 .929-.171 1.656 1.656 0 0 0 .949-.95 2.766 2.766 0 0 0 .172-.928c.024-.527.029-.685.029-2.02s-.005-1.493-.03-2.02a2.766 2.766 0 0 0-.171-.929zM9.6 12.168A2.568 2.568 0 1 1 12.168 9.6 2.568 2.568 0 0 1 9.6 12.168zm2.669-4.637a.6.6 0 1 1 .6-.6.6.6 0 0 1-.6.6zM11.267 9.6A1.667 1.667 0 1 1 9.6 7.933 1.667 1.667 0 0 1 11.267 9.6zM9.6 0a9.6 9.6 0 1 0 9.6 9.6A9.6 9.6 0 0 0 9.6 0zm4.97 11.661a3.67 3.67 0 0 1-.233 1.214 2.556 2.556 0 0 1-1.462 1.462 3.67 3.67 0 0 1-1.213.233c-.534.024-.704.03-2.062.03s-1.528-.006-2.062-.03a3.67 3.67 0 0 1-1.213-.233 2.556 2.556 0 0 1-1.462-1.462 3.67 3.67 0 0 1-.233-1.213c-.024-.534-.03-.704-.03-2.062s.006-1.528.03-2.062a3.67 3.67 0 0 1 .232-1.213 2.556 2.556 0 0 1 1.463-1.463 3.67 3.67 0 0 1 1.213-.232c.534-.024.704-.03 2.062-.03s1.528.006 2.062.03a3.67 3.67 0 0 1 1.213.232 2.556 2.556 0 0 1 1.462 1.463 3.67 3.67 0 0 1 .233 1.213c.024.534.03.704.03 2.062s-.006 1.528-.03 2.062z"/></svg>
                      <p class="p-footer-text">Instagram</p>
                    </div>
                   </a>

                   <!-- twitch -->
                   <a href="https://dashboard.twitch.tv/u/giramip_j/home">
                    <div class="d-grid gap-2 d-md-flex justify-content-md-start"><br>
                    <svg height="21" viewBox="0 0 512 512" width="21" xmlns="http://www.w3.org/2000/svg"><path d="m391.17 103.47h-38.63v109.7h38.63zm-106.17-.47h-38.63v109.75h38.63zm-164.17-103-96.52 91.42v329.16h115.83v91.42l96.53-91.42h77.25l173.77-164.58v-256zm328.24 237.75-77.22 73.12h-77.24l-67.6 64v-64h-86.87v-274.29h308.93z"/></svg>
                      <p class="p-footer-text">twitch</p>
                    </div>
                   </a>
                  
                </div>
              </div>

              <div class="col">
                <div class="card-body">
                <p class="p-footer" style="color: #ff66c4;">ชีวิตที่ดี</p>
                <p class="p-footer-text">มีความสุขและความพอใจในสิ่งที่มี พัฒนาและเติบโตทั้งในด้านร่างกายและจิตใจ</p> <br>

                <p class="p-footer" style="color: #ff66c4;">สิ่งสำคัญ</p>
                <p class="p-footer-text">สร้างสมดุลระหว่างการทำงาน ความสัมพันธ์ และการดูแลตัวเอง เพื่อให้เราได้ใช้ชีวิตอย่างมีคุณค่าและความหมายในแบบของเราเอง</p>
                </div>
              </div> 

            </div>
            
          </div>
        </footer>